# Изучаем Django и AngularJS

В этом учебном пособии Вы создадите упрощенный Google+ клон под названием "Not Google Plus", используя Django и AngularJS.

Но перед тем как начать обучение и научиться создавать полноценное, современное веб приложение с помощью Django и AngularJS,
давайте уделим немного времени мотивации, побудившей написать это пособие и тому как по максимуму использовать данное учебное пособие.

## Какова цель данного учебного пособия?

Здесь в Thinkster, мы стремимся создавать высококачественные, глубокие по содержанию материалы, сохраняя при этом низкий порог вхождения.
Мы бесплатно публикуем этот материал, надеясь, что он окажется интересным и информативным для Вас.

У каждого учебного посбия, опубликованного нами, есть конкретная цель. Цель этого пособия - рассмотреть как можно совместно 
использовать Django и AngularJS и как эти технологии можно объединить, чтобы создать потрясающие воображение веб приложения. Кроме того мы 
уделяем большое внимание выработке полезных привычек, используемых при проектировании. Это включает все, начиная от учета компромиссов, 
возникающих при принятии архитектурных решений, заканчивая высоким качеством кода на протяжении всего проекта. Хотя все это может
казаться сложным, это основа, необходимая, чтобы стать полноценным разработчиком программного обеспечения.

## Для кого это учебное пособие?
